html/erlang/tutorial/sequential/high_order_function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>高阶函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="built_in_function.html"> UP </a>
 |
 <a accesskey="H" href="sequential.html"> HOME </a>
</div><div id="content">
<h1 class="title">高阶函数</h1>
<p>
Erlang 作为函数式编程语言自然拥有 <span class="underline">高阶函数</span> 。在 shell 中，可以这样使用：
</p>

<div class="org-src-container">
<pre class="src src-sh">12&gt; <span style="color: #4eee94;">Xf</span>=fun(X) -&gt; X * 2 end. 
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Fun&lt;erl_eval.6.128620087&gt;</span>

13&gt; Xf(5)<span style="color: #f08080;">.</span> 
10
</pre>
</div>

<pre class="example">
这里定义了一个数值翻倍的函数，并将这个函数赋给了一个变量

所以，Xf(5) 返回值为 10 
</pre>
<p>
Erlang 有两个非常有用的操作列表的函数 <span class="underline">foreach</span> 与 <span class="underline">map</span> ， 定义如下：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">foreach</span>(<span style="color: #4eee94;">Fun</span>, [<span style="color: #4eee94;">First</span>|<span style="color: #4eee94;">Rest</span>]) -&gt;
    <span style="color: #4eee94;">Fun</span>(<span style="color: #4eee94;">First</span>),
    <span style="color: #98f5ff;">foreach</span>(<span style="color: #4eee94;">Fun</span>, <span style="color: #4eee94;">Rest</span>);
<span style="color: #daa520; font-weight: bold;">foreach</span>(<span style="color: #4eee94;">Fun</span>, []) -&gt;
    ok.

<span style="color: #daa520; font-weight: bold;">map</span>(<span style="color: #4eee94;">Fun</span>, [<span style="color: #4eee94;">First</span>|<span style="color: #4eee94;">Rest</span>]) -&gt;<span style="color: #daa520; font-weight: bold;"> </span>
    [<span style="color: #4eee94;">Fun</span>(<span style="color: #4eee94;">First</span>)|<span style="color: #f08080;">map</span>(<span style="color: #4eee94;">Fun</span>,<span style="color: #4eee94;">Rest</span>)];
<span style="color: #daa520; font-weight: bold;">map</span>(<span style="color: #4eee94;">Fun</span>, []) -&gt;<span style="color: #daa520; font-weight: bold;"> </span>
    [].
</pre>
</div>

<p>
这两个函数是由标准模块 <span class="underline">lists</span> 提供的：
</p>
<ul class="org-ul">
<li>foreach: 将一个函数作用于列表中的每一个元素</li>
<li>map: 通过将一个函数作用于列表中的每个元素生成一个新的列表</li>
</ul>

<p>
使用 map 的 Add_3 函数生成一个新的列表：
</p>
<div class="org-src-container">
<pre class="src src-sh">14&gt; Add_3 = fun(X) -&gt; X + 3 end. 
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Fun&lt;erl_eval.6.128620087&gt;</span>

15&gt; lists:map(Add_3, [1,2,3])<span style="color: #f08080;">.</span> 
[4,5,6]
</pre>
</div>

<p>
再次输出一组城市的温度值：
</p>
<div class="org-src-container">
<pre class="src src-sh">16&gt; Print_City = fun({City, {X, Temp}}) -&gt; io:format(<span style="color: #deb887;">"~-15w ~w ~w~n"</span>, 
16&gt; [City, X, Temp]) end.
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Fun&lt;erl_eval.6.128620087&gt;</span>

17&gt; lists:foreach(Print_City, [{moscow, {c, -10}}, {cape_town, {f, 70}},
17&gt; {stockholm, {c, -4}}, {paris, {f, 28}}, {london, {f, 36}}])<span style="color: #f08080;">.</span>
moscow          c -10
cape_town       f 70
stockholm       c -4
paris           f 28
london          f 36
ok
</pre>
</div>

<p>
重新定义一个函数，这个函数用于遍历城市温度列表并将每个温度值都转换为摄氏温度表示。如下所示：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(high_order).

<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">convert_list_to_c/1</span>]).

<span style="color: #daa520; font-weight: bold;">convert_to_c</span>({<span style="color: #4eee94;">Name</span>, {f, <span style="color: #4eee94;">Temp</span>}}) -&gt;
    {<span style="color: #4eee94;">Name</span>, {c, <span style="color: #f08080;">trunc</span>((<span style="color: #4eee94;">Temp</span> - 32) * 5 / 9)}};
<span style="color: #daa520; font-weight: bold;">convert_to_c</span>({<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}}) -&gt;
    {<span style="color: #4eee94;">Name</span>, {c, <span style="color: #4eee94;">Temp</span>}}.

<span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>(<span style="color: #4eee94;">List</span>) -&gt;
    <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">map</span>(<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #98f5ff;">convert_to_c/1</span>, <span style="color: #4eee94;">List</span>).
</pre>
</div>

<p>
convert_to_c 函数和之前的一样，但是它现在被用作高阶函数：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>(<span style="color: #4eee94;">List</span>) -&gt;
    <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">map</span>(<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #98f5ff;">convert_to_c/1</span>, <span style="color: #4eee94;">List</span>).
</pre>
</div>

<p>
当一个在别处定义的函数被用作高阶函数时，可以通过 <span class="underline">Function/Arity</span> 的方式来引用它：
</p>
<ul class="org-ul">
<li>Function 为函数名</li>
<li>Arity 为函数的参数个数</li>
</ul>

<pre class="example">
所以在调用 map 函数时，才会是 lists:map(fun convert_to_c/1, List) 这样的形式

如上所示，convert_list_to_c 变得更加的简洁易懂
</pre>

<p>
测试如下：
</p>

<div class="org-src-container">
<pre class="src src-sh">2&gt; high_order:convert_list_to_c([{moscow, {c, -10}}, {cape_town, {f, 70}},
2&gt; {stockholm, {c, -4}}, {paris, {f, 28}}, {london, {f, 36}}])<span style="color: #f08080;">.</span>
[{moscow,{c,-10}},
 {cape_town,{c,21}},
 {stockholm,{c,-4}},
 {paris,{c,-2}},
 {london,{c,2}}]
</pre>
</div>

<p>
lists 标准库中还包括排序函数 <span class="underline">sort(Fun,List)</span> ，其中： 
</p>
<ul class="org-ul">
<li>Fun 接受两个输入参数，如果第一个元素比第二个元素小则函数返回真，否则返回假</li>
</ul>

<p>
把排序添加到 convert_list_to_c 中： 
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">convert_list_to_c</span>(<span style="color: #4eee94;">List</span>) -&gt;
    <span style="color: #4eee94;">New_list</span> = <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">map</span>(<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #98f5ff;">convert_to_c/1</span>, <span style="color: #4eee94;">List</span>),
    <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">sort</span>(<span style="color: #00bfff; font-weight: bold;">fun</span>({<span style="color: #4eee94;">_</span>, {c, <span style="color: #4eee94;">Temp1</span>}}, {<span style="color: #4eee94;">_</span>, {c, <span style="color: #4eee94;">Temp2</span>}}) -&gt;
                       <span style="color: #4eee94;">Temp1</span> &lt; <span style="color: #4eee94;">Temp2</span> <span style="color: #00bfff; font-weight: bold;">end</span>, <span style="color: #4eee94;">New_list</span>).
</pre>
</div>

<p>
在 sort 中用到了下面这个函数：
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">fun</span>({<span style="color: #4eee94;">_</span>, {c, <span style="color: #4eee94;">Temp1</span>}}, {<span style="color: #4eee94;">_</span>, {c, <span style="color: #4eee94;">Temp2</span>}}) -&gt;<span style="color: #daa520; font-weight: bold;"> </span><span style="color: #4eee94;">Temp1</span> &lt; <span style="color: #4eee94;">Temp2</span> <span style="color: #00bfff; font-weight: bold;">end</span>,
</pre>
</div>

<p>
这儿用到了 <b>匿名变量</b> "_" 的概念。匿名变量常用于忽略一个获得的变量值的场景下
</p>

<pre class="example">
当然，它也可以用到其它的场景中，而不仅仅是在高阶函数这儿

Temp1 &lt; Temp2 说明如果 Temp1 比 Temp2 小，则返回 true
</pre>

<p>
最后测试下：
</p>
<div class="org-src-container">
<pre class="src src-sh">4&gt; high_order:convert_list_to_c([{moscow, {c, -10}}, {cape_town, {f, 70}},
4&gt; {stockholm, {c, -4}}, {paris, {f, 28}}, {london, {f, 36}}])<span style="color: #f08080;">.</span>           
[{moscow,{c,-10}},
 {stockholm,{c,-4}},
 {paris,{c,-2}},
 {london,{c,2}},
 {cape_town,{c,21}}]
</pre>
</div>

<p>
<a href="../concurrency/concurrency.html">Next：并发编程</a>
</p>

<p>
<a href="built_in_function.html">Previous：内置函数</a>
</p>

<p>
<a href="sequential.html">Home：顺序编程</a>
</p>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
